Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
/**
 * Copyright (c) 2021 windowsair <msdn_02 at sina.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */
#include <stdint.h>
#include <string.h>
#include <sys/param.h>

#include "corsacOTA.h"

#include "esp_log.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "mbedtls/base64.h"
#include "mbedtls/sha1.h"

#include "esp_ota_ops.h"
#include "esp_partition.h"
#include "esp_system.h"

#include "lwip/err.h"
#include "lwip/sockets.h"
#include "lwip/sys.h"
#include <lwip/netdb.h>
// 添加UART驱动头文件
#include "driver/uart.h"

#include "sdkconfig.h"
#if (defined CONFIG_IDF_TARGET_ESP8266) && (CONFIG_IDF_TARGET_ESP8266 == 1)
#define CO_TARGET_ESP8266 1
#define CO_DEVICE_TYPE_NAME "esp8266"
#include "esp8266/eagle_soc.h"
#endif

#if (defined CONFIG_IDF_TARGET_ESP32) && (CONFIG_IDF_TARGET_ESP32 == 1)
#define CO_TARGET_ESP32 1
#define CO_DEVICE_TYPE_NAME "esp32"
#include "esp32/rom/uart.h"
#include "hal/wdt_hal.h"
#include "hal/wdt_types.h"
#include "soc/rtc.h"
#endif

#if (defined CONFIG_IDF_TARGET_ESP32S2) && (CONFIG_IDF_TARGET_ESP32S2 == 1)
#define CO_DEVICE_TYPE_NAME "esp32s2"
#define CO_TARGET_ESP32 1
#include "esp32s2/rom/uart.h"
#include "hal/wdt_hal.h"
#include "hal/wdt_types.h"
#include "soc/rtc.h"
#endif

#if (defined CONFIG_IDF_TARGET_ESP32C3) && (CONFIG_IDF_TARGET_ESP32C3 == 1)
#define CO_DEVICE_TYPE_NAME "esp32c3"
#define CO_TARGET_ESP32C3 1
#include "esp32c3/rom/uart.h"
#include "hal/wdt_hal.h"
#include "hal/wdt_types.h"
#include "soc/rtc.h"
#endif

#if (defined CONFIG_IDF_TARGET_ESP32S3) && (CONFIG_IDF_TARGET_ESP32S3 == 1)
#define CO_DEVICE_TYPE_NAME "esp32s3"
#define CO_TARGET_ESP32S3 1
#include "esp32s3/rom/uart.h"
#include "hal/wdt_hal.h"
#include "hal/wdt_types.h"
#include "soc/rtc.h"
#endif

#if (!defined CO_TARGET_ESP8266) && (!defined CO_TARGET_ESP32) && (!defined CONFIG_IDF_TARGET_ESP32S2) && (!defined CONFIG_IDF_TARGET_ESP32C3) && (!defined CONFIG_IDF_TARGET_ESP32S3)
#error Unknown hardware platform
#endif

#if (defined CONFIG_PARTITION_TABLE_SINGLE_APP) && (CONFIG_PARTITION_TABLE_SINGLE_APP == 1)
#warning No OTA partition configured. corsacOTA may not work!
#endif

static const char *CO_TAG = "corsacOTA";

#define CONFIG_CO_SOCKET_BUFFER_SIZE 1500
#define CONFIG_CO_WS_TEXT_BUFFER_SIZE 100

#define LOG_FMT(x) "%s: " x, __func__

#define min(a, b) ((a) < (b) ? (a) : (b))

#define CO_NO_RETURN __attribute__((noreturn))
#define CO_INLINE __attribute__((always_inline))

#define CO_TEST_MODE 0

#if (CO_TEST_MODE == 1)
#warning corsacOTA test mode is in use
#endif

/**
 * @brief corsacOTA websocket control block
 *
 */
typedef struct co_websocket_cb
{
    uint8_t FIN;
    uint8_t OPCODE;

    uint8_t MASK;
    size_t payload_len; // it is used not only for the 7-bit payload len,
                        // but also for the total length of the payload after the extended payload length is included.

    size_t payload_read_len; // the number of payload bytes already read

    union
    {
        uint32_t val;
        uint8_t data[4];
    } mask;

    bool skip_frame; // skip too long text frames
} co_websocket_cb_t;

/**
 * @brief corsacOTA socket control block
 *
 */
typedef struct co_socket_cb
{
    int fd; // The file descriptor for this socket
    enum co_socket_status
    {
        CO_SOCKET_ACCEPT = 0,
        CO_SOCKET_HANDSHAKE,               // not handshake, or in progress
        CO_SOCKET_WEBSOCKET_HEADER,        // already handshake, now reading the header of websocket frame
        CO_SOCKET_WEBSOCKET_EXTEND_LENGTH, // reading the extended length of websocket header
        CO_SOCKET_WEBSOCKET_MASK,          // reading the mask part of websocket header
        CO_SOCKET_WEBSOCKET_PAYLOAD,       // reading the payload of websocket frame
        CO_SOCKET_CLOSING                  // waiting to close
    } status;

    char *buf;            // data from raw socket
    size_t remaining_len; // the number of available bytes remaining in buf
    size_t read_len;      // the number of bytes that have been processed

    co_websocket_cb_t wcb; // websocket control block

} co_socket_cb_t;

typedef struct {
    uint32_t offset;
    uint8_t data[64];
    size_t size;
} verify_point_t;

/**
 * @brief corsacOTA OTA control block
 *
 */
typedef struct co_ota_cb
{
    enum co_ota_status
    {
        CO_OTA_INIT = 0,
        CO_OTA_LOAD,
        CO_OTA_DONE,
        CO_OTA_STOP,
        CO_OTA_ERROR,
        CO_OTA_FATAL_ERROR,
    } status;
    int32_t error_code; //// TODO: ?

    const esp_partition_t *update_ptn;
    const esp_partition_t *running_ptn;
    esp_ota_handle_t update_handle;

    int32_t total_size;        // Total firmware size
    int32_t offset;            // Current processed size
    int32_t chunk_size;        // The response will be made every time the chunk size is reached
    int32_t last_index_offset; // The offset recorded in the last response

    // 新增ISP升级相关字段
    bool is_isp_mode;        // true: 升级下级设备, false: 升级ESP自身
    uint8_t isp_device_type; // 目标设备类型
    uint8_t isp_uart_port;   // ISP使用的UART端口
    uint32_t isp_baudrate;   // ISP使用的波特率

    verify_point_t verify_points[3]; // 保存多个验证点
    int verify_point_count; // 当前验证点数量
    
} co_ota_cb_t;



/**
 * @brief corsacOTA http control block
 *
 */
typedef struct co_cb
{
    int listen_fd;        // server listener FD
    int websocket_fd;     // only one websocket is allowed.
    uint8_t *recv_data;   // recv buffer at websocket stage (text mode)
    int recv_data_offset; // (text mode)
    int max_listen_num;   // maxium number of connections. In fact, after the handshake is complete, there is only one connection to provide services

    int wait_timeout_sec;  // timeout (in seconds)
    int wait_timeout_usec; // timeout (in microseconds)

    co_socket_cb_t **socket_list; // socket control block list
    co_socket_cb_t *websocket;    // the only valid socket in the list

    int accept_num; // current number of established connections

    int closing_num; // current number of closing socket

