Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
    // 查找字段
    const char *op_start = strstr(text, "op=");
    const char *data_start = strstr(text, "&data=");
    const char *target_start = strstr(text, "&target=");
    const char *options_start = strstr(text, "&options=");

    if (!op_start)
    {
        ESP_LOGE(CO_TAG, "解析错误：缺少op字段 [%s]", text);
        return CO_FAIL; // 必须有op字段
    }

    // 解析op字段
    op_start += 3; // 跳过"op="
    const char *op_end = strchr(op_start, '&');
    if (!op_end)
        op_end = op_start + strlen(op_start); // 如果是最后一个字段
    int op_len = op_end - op_start;
    if (op_len > 10)
        op_len = 10; // 限制长度
    strncpy(op, op_start, op_len);
    op[op_len] = '\0';

    // 解析data字段（如果存在）
    if (data_start)
    {
        data_start += 6; // 跳过"&data="
        const char *data_end = strstr(data_start, "&");
        if (!data_end)
            data_end = data_start + strlen(data_start); // 如果是最后一个字段
        int data_len = data_end - data_start;
        if (data_len > 10)
            data_len = 10; // 限制长度
        strncpy(data, data_start, data_len);
        data[data_len] = '\0';
    }
    else
    {
        // data字段可选
        data[0] = '\0';
    }

    // 如果有target字段
    if (target_start)
    {
        target_start += 8; // 跳过"&target="
        const char *target_end = strstr(target_start, "&");
        if (!target_end)
            target_end = target_start + strlen(target_start); // 如果是最后一个字段
        int target_len = target_end - target_start;
        if (target_len > 10)
            target_len = 10; // 限制长度
        strncpy(target, target_start, target_len);
        target[target_len] = '\0';
    }

    // 如果有options字段
    if (options_start)
    {
        options_start += 9; // 跳过"&options="

        // 使用snprintf安全地复制字符串，确保不超过缓冲区大小
        snprintf(options, 51, "%s", options_start);

        // 如果原字符串太长，在日志中提示
        if (strlen(options_start) > 50)
        {
            ESP_LOGW(CO_TAG, "options字段被截断: 超过50字符的限制");
        }
    }

    ESP_LOGI(CO_TAG, "解析结果: op=%s, data=%s, target=%s, options=%s",
             op, data, strlen(target) > 0 ? target : "(空)",
             strlen(options) > 0 ? options : "(空)");

    return CO_OK;
}

// 增加校验和计算函数
static uint8_t stm32_checksum(uint8_t *data, int len)
{
    int i;
    uint8_t cs = 0;
    for (i = 0; i < len; i++)
        cs ^= data[i];
    return cs;
}

static const char *co_isp_ota_init(uint8_t device_type, int32_t size, uint32_t baudrate)
{
    ESP_LOGI(CO_TAG, "初始化ISP模式连接 (设备类型:%d, 波特率:%d)", device_type, baudrate);
    
    // 释放可能已存在的UART资源
    uart_driver_delete(UART_NUM_1);

    global_cb->ota.verify_point_count = 0;  // 重置验证点计数器

    // 配置ISP通信的UART - 针对STM32使用偶校验
    uart_config_t uart_config = {
        .baud_rate = baudrate,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_EVEN,    // STM32 Bootloader要求偶校验
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE
    };

    // 使用UART1作为ISP接口
    global_cb->ota.isp_uart_port = UART_NUM_1;
    global_cb->ota.isp_baudrate = baudrate;

    // 配置UART
    esp_err_t err = uart_param_config(global_cb->ota.isp_uart_port, &uart_config);
    if (err != ESP_OK) {
        return "UART配置失败";
    }
    
    // 安装UART驱动
    err = uart_driver_install(global_cb->ota.isp_uart_port, 2048, 2048, 0, NULL, 0);
    if (err != ESP_OK) {
        return "UART驱动安装失败";
    }

    // 设置UART引脚
    uart_set_pin(global_cb->ota.isp_uart_port, 19, 18, -1, -1);
    
    // 清空缓冲区
    uart_flush(global_cb->ota.isp_uart_port);
    
    // 记录设备类型
    global_cb->ota.isp_device_type = device_type;
    
    // 同步STM32 Bootloader (多次尝试)
    uint8_t sync_byte = 0x7F;
    ESP_LOGI(CO_TAG, "尝试与STM32建立同步...");
    
    for (int attempt = 0; attempt < 10; attempt++) {
        // 清空接收缓冲区
        uart_flush_input(global_cb->ota.isp_uart_port);
        
        // 发送同步字节
        uart_write_bytes(global_cb->ota.isp_uart_port, &sync_byte, 1);
        
        // 等待ACK
        uint8_t response[1] = {0};
        int len = uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(100));
        
        if (len > 0 && response[0] == 0x79) {
            ESP_LOGI(CO_TAG, "STM32同步成功");
            
            // 获取支持的命令和版本信息
            ESP_LOGI(CO_TAG, "正在获取STM32 Bootloader信息...");
            uint8_t get_cmd = 0x00;
            uint8_t get_complement = 0xFF;
            uart_write_bytes(global_cb->ota.isp_uart_port, &get_cmd, 1);
            uart_write_bytes(global_cb->ota.isp_uart_port, &get_complement, 1);
            
            // 等待响应
            uint8_t bl_info[20];
            len = uart_read_bytes(global_cb->ota.isp_uart_port, bl_info, 20, pdMS_TO_TICKS(500));
            
            if (len > 3) {
                ESP_LOGI(CO_TAG, "Bootloader版本: 0x%02X, 支持命令数: %d", bl_info[1], bl_info[0]);
                
                // 获取设备ID
                ESP_LOGI(CO_TAG, "正在获取STM32设备ID...");
                uint8_t get_id_cmd[2] = {0x02, 0xFD};
                uart_write_bytes(global_cb->ota.isp_uart_port, get_id_cmd, 2);
                
                // 等待ACK
                uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(100));
                
                if (response[0] == 0x79) {
                    // 读取PID
                    uint8_t pid_data[5];
                    uart_read_bytes(global_cb->ota.isp_uart_port, pid_data, 5, pdMS_TO_TICKS(100));
                    uint16_t pid = ((uint16_t)pid_data[1] << 8) | pid_data[2];
                    ESP_LOGI(CO_TAG, "STM32 PID: 0x%04X", pid);
                }
            }
            
            // 执行全片擦除
            ESP_LOGI(CO_TAG, "开始擦除STM32固件...");
            uint8_t erase_cmd[2] = {0x43, 0xBC};
            uart_write_bytes(global_cb->ota.isp_uart_port, erase_cmd, 2);
            
            // 等待ACK
            uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500));
            
            if (response[0] != 0x79) {
                uart_driver_delete(global_cb->ota.isp_uart_port);
                return "擦除命令不被接受";
            }
            
            // 发送全片擦除参数
            uint8_t full_erase[2] = {0xFF, 0x00};
            uart_write_bytes(global_cb->ota.isp_uart_port, full_erase, 2);
            
            // 等待擦除完成
            ESP_LOGI(CO_TAG, "等待擦除完成...");
            len = uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(10000));
            
            if (response[0] != 0x79) {
                uart_driver_delete(global_cb->ota.isp_uart_port);
                return "擦除固件失败";
            }
            if (response[0] == 0x79) {
                ESP_LOGI(CO_TAG, "STM32固件擦除成功");
            }

