Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
            // ESP_LOGI(CO_TAG, "STM32固件擦除成功");
            return NULL;  // 成功初始化
        }
        
        ESP_LOGW(CO_TAG, "同步尝试 %d 失败，重试...", attempt+1);
        vTaskDelay(pdMS_TO_TICKS(50));
    }
    
    uart_driver_delete(global_cb->ota.isp_uart_port);
    return "无法与STM32建立同步连接";
}
static const char *co_isp_ota_write(void *data, size_t len)
{
    uint8_t *buf = (uint8_t *)data;
    size_t bytes_left = len;
    size_t pos = 0;
    uint8_t response[1];

    // 处理STM32设备
    if (global_cb->ota.isp_device_type == 1)
    {
        ESP_LOGI(CO_TAG, "开始写入STM32固件数据: %d字节", len);
        
        // 数据有效性检查
        if (data == NULL || len == 0) {
            return "无效的数据";
        }
        
        // 检查当前是否应该保存验证点
        // 策略：保存开头、中间和结尾的三个验证点
        uint32_t current_offset = global_cb->ota.offset;
        uint32_t total_size = global_cb->ota.total_size;
        
        bool save_verification_point = false;
        
        // 保存头部验证点 (第一个数据块)
        if (current_offset == 0 && global_cb->ota.verify_point_count < 3) {
            save_verification_point = true;
        }
        // 保存中间验证点 (大约50%位置)
        else if (current_offset <= total_size / 2 && 
                 current_offset + len > total_size / 2 && 
                 global_cb->ota.verify_point_count < 3) {
            save_verification_point = true;
        }
        // 保存尾部验证点 (最后一个数据块)
        else if (current_offset + len >= total_size && 
                 global_cb->ota.verify_point_count < 3) {
            save_verification_point = true;
        }
        
        // 保存验证点
        if (save_verification_point) {
            verify_point_t *point = &global_cb->ota.verify_points[global_cb->ota.verify_point_count];
            point->offset = current_offset;
            // 确定保存的验证点大小（最多64字节）
            size_t copy_size = (len > 64) ? 64 : len;
            memcpy(point->data, buf, copy_size);
            point->size = copy_size;
            
            ESP_LOGI(CO_TAG, "保存验证点 %d: 偏移 0x%08X, 大小 %d字节", 
                     global_cb->ota.verify_point_count + 1, 
                     point->offset, 
                     point->size);
                     
            global_cb->ota.verify_point_count++;
        }
        
        while (bytes_left > 0)
        {
            // 确定当前块大小，最大256字节
            size_t chunk_size = bytes_left > 256 ? 256 : bytes_left;
            
            // 计算当前写入地址
            uint32_t current_addr = 0x08000000 + (global_cb->ota.offset - bytes_left);
            
            ESP_LOGI(CO_TAG, "写入地址: 0x%08X, 块大小: %d字节", current_addr, chunk_size);
            
            // 准备地址字节
            uint8_t addr_bytes[4]; 
            addr_bytes[0] = (current_addr >> 24) & 0xFF;
            addr_bytes[1] = (current_addr >> 16) & 0xFF;
            addr_bytes[2] = (current_addr >> 8) & 0xFF;
            addr_bytes[3] = current_addr & 0xFF;
            
            // 发送写入命令
            uint8_t write_cmd[2] = {0x31, 0xCE};
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)write_cmd, 2);
            
            // 等待ACK
            size_t read_len = uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500));
            if (read_len <= 0 || response[0] != 0x79) {
                ESP_LOGE(CO_TAG, "写入命令失败，响应: 0x%02X", read_len > 0 ? response[0] : 0);
                return "写入命令被拒绝";
            }
            
            // 发送地址
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)addr_bytes, 4);
            
            // 发送地址校验和
            uint8_t addr_checksum = stm32_checksum(addr_bytes, 4);
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&addr_checksum, 1);
            
            // 等待地址确认ACK
            read_len = uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500));
            if (read_len <= 0 || response[0] != 0x79) {
                ESP_LOGE(CO_TAG, "地址设置失败，响应: 0x%02X", read_len > 0 ? response[0] : 0);
                return "设置写入地址失败";
            }
            
            
            // 发送数据长度-1
            uint8_t data_len = chunk_size - 1;
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&data_len, 1);
            
            // 发送数据
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)(buf + pos), chunk_size);
            
            // 计算并发送校验和
            uint8_t checksum = data_len;
            for (int i = 0; i < chunk_size; i++) {
                checksum ^= buf[pos + i];
            }
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&checksum, 1);
            
            // 等待数据写入确认ACK
            read_len = uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(1000));
            if (read_len <= 0 || response[0] != 0x79) {
                ESP_LOGE(CO_TAG, "数据写入失败，响应: 0x%02X", read_len > 0 ? response[0] : 0);
                return "写入数据块失败";
            }
            
            // 更新位置和剩余字节
            pos += chunk_size;
            bytes_left -= chunk_size;
            
            // 适当延迟，防止STM32处理不过来
            vTaskDelay(pdMS_TO_TICKS(10));
        }
        
        ESP_LOGI(CO_TAG, "STM32固件数据写入成功");


    }
    else
    {
        return "不支持的设备类型";
    }

    return NULL; // 成功
}

// static const char *co_isp_ota_end()
// {
//     uint8_t response[1];
//     uint8_t verify_buffer[256];
//     bool verify_ok = true;

//     // 完成STM32烧录
//     if (global_cb->ota.isp_device_type == 1)
//     {
//         ESP_LOGI(CO_TAG, "固件烧录完成，进行验证");
        
//         // 简单验证：读取第一块数据并检查
//         uint32_t verify_addr = 0x08000000;
//         uint8_t addr_bytes[4]; 
//         addr_bytes[0] = (verify_addr >> 24) & 0xFF;
//         addr_bytes[1] = (verify_addr >> 16) & 0xFF;
//         addr_bytes[2] = (verify_addr >> 8) & 0xFF;
//         addr_bytes[3] = verify_addr & 0xFF;
        
//         // 发送读取命令
//         uint8_t read_cmd[2] = {0x11, 0xEE};
//         uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)read_cmd, 2);
        
//         // 等待ACK
//         if (uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500)) <= 0 || 
//             response[0] != 0x79) {
//             ESP_LOGW(CO_TAG, "读取命令失败，跳过验证");
//         } else {
//             // 发送地址
//             uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)addr_bytes, 4);
//             uint8_t addr_checksum = stm32_checksum(addr_bytes, 4);
//             uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&addr_checksum, 1);
            
//             // 等待地址确认ACK
//             if (uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500)) <= 0 || 
//                 response[0] != 0x79) {
//                 ESP_LOGW(CO_TAG, "设置读取地址失败，跳过验证");
//             } else {
//                 // 读取128字节数据
//                 uint8_t read_len = 128 - 1;  // N-1
//                 uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&read_len, 1);
//                 uint8_t read_len_complement = ~read_len;
//                 uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&read_len_complement, 1);
                
