Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
//                 // 等待ACK并读取数据
//                 if (uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500)) > 0 && 
//                     response[0] == 0x79) {
//                     // 读取验证数据
//                     size_t bytes_read = uart_read_bytes(global_cb->ota.isp_uart_port, 
//                                                        verify_buffer, 
//                                                        128, 
//                                                        pdMS_TO_TICKS(1000));
                    
//                     if (bytes_read == 128) {
//                         ESP_LOGI(CO_TAG, "固件验证成功");
//                         verify_ok = true;
//                     } else {
//                         ESP_LOGW(CO_TAG, "固件验证数据读取不完整");
//                     }

//                     uint8_t *original_data = ... // 原始固件数据指针
//                         for (int i = 0; i < bytes_read; i++)
//                     {
//                         if (verify_buffer[i] != original_data[i])
//                         {
//                             ESP_LOGE(CO_TAG, "固件验证失败: 位置 %d, 期望 0x%02X, 实际 0x%02X",
//                                      i, original_data[i], verify_buffer[i]);
//                             verify_ok = false;
//                             break;
//                         }
//                     }
//                 }
//             }
//         }
        
//         if (verify_ok) {
//             ESP_LOGI(CO_TAG, "准备重置并运行STM32应用程序");
            
//             // 发送执行命令
//             uint8_t go_cmd[2] = {0x21, 0xDE};
//             uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)go_cmd, 2);
            
//             // 等待ACK
//             uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500));
            
//             // 发送执行地址（通常是0x08000000）
//             uint32_t go_addr = 0x08000000;
//             addr_bytes[0] = (go_addr >> 24) & 0xFF;
//             addr_bytes[1] = (go_addr >> 16) & 0xFF;
//             addr_bytes[2] = (go_addr >> 8) & 0xFF;
//             addr_bytes[3] = go_addr & 0xFF;
            
//             uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)addr_bytes, 4);
//             uint8_t go_checksum = stm32_checksum(addr_bytes, 4);
//             uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&go_checksum, 1);
            
//             // 最后的ACK可能收不到，因为STM32已经开始执行应用了
//             uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(100));
//         }
//     }

//     // 释放资源
//     uart_driver_delete(global_cb->ota.isp_uart_port);
//     return NULL; // 成功
// }    


static const char *co_isp_ota_end()
{
    uint8_t response[1];
    uint8_t verify_buffer[256];
    bool verify_ok = true;

    // 完成STM32烧录
    if (global_cb->ota.isp_device_type == 1)
    {
        // 如果有保存验证点，就执行增强验证
        if (global_cb->ota.verify_point_count > 0) {
            ESP_LOGI(CO_TAG, "开始执行多区段固件验证 (共%d个验证点)...", 
                     global_cb->ota.verify_point_count);
            
            // 逐个验证所有保存的验证点
            for (int i = 0; i < global_cb->ota.verify_point_count; i++) {
                verify_point_t *point = &global_cb->ota.verify_points[i];
                ESP_LOGI(CO_TAG, "验证点 %d: 地址 0x%08X, 大小 %d字节", 
                         i + 1, 
                         0x08000000 + point->offset, 
                         point->size);
                
                // 准备读取地址
                uint32_t verify_addr = 0x08000000 + point->offset;
                uint8_t addr_bytes[4]; 
                addr_bytes[0] = (verify_addr >> 24) & 0xFF;
                addr_bytes[1] = (verify_addr >> 16) & 0xFF;
                addr_bytes[2] = (verify_addr >> 8) & 0xFF;
                addr_bytes[3] = verify_addr & 0xFF;
                
                // 发送读取命令
                uint8_t read_cmd[2] = {0x11, 0xEE};
                uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)read_cmd, 2);
                
                // 等待ACK
                if (uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500)) <= 0 || 
                    response[0] != 0x79) {
                    ESP_LOGE(CO_TAG, "验证点 %d: 读取命令失败", i + 1);
                    verify_ok = false;
                    continue; // 尝试下一个验证点
                }
                
                // 发送地址
                uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)addr_bytes, 4);
                uint8_t addr_checksum = stm32_checksum(addr_bytes, 4);
                uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&addr_checksum, 1);
                
                // 等待地址确认ACK
                if (uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500)) <= 0 || 
                    response[0] != 0x79) {
                    ESP_LOGE(CO_TAG, "验证点 %d: 设置读取地址失败", i + 1);
                    verify_ok = false;
                    continue; // 尝试下一个验证点
                }
                
                // 读取数据
                uint8_t read_len = point->size - 1;  // N-1
                uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&read_len, 1);
                uint8_t read_len_complement = ~read_len;
                uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&read_len_complement, 1);
                
                // 等待ACK并读取数据
                if (uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500)) > 0 && 
                    response[0] == 0x79) {
                    
                    // 读取验证数据
                    size_t bytes_read = uart_read_bytes(global_cb->ota.isp_uart_port, 
                                                       verify_buffer, 
                                                       point->size, 
                                                       pdMS_TO_TICKS(1000));
                    
                    if (bytes_read == point->size) {
                        // 比较数据
                        bool point_valid = true;
                        for (int j = 0; j < point->size; j++) {
                            if (verify_buffer[j] != point->data[j]) {
                                ESP_LOGE(CO_TAG, "验证点 %d: 字节 %d 校验失败 [期望 0x%02X, 实际 0x%02X]", 
                                         i + 1, j, point->data[j], verify_buffer[j]);
                                point_valid = false;
                                verify_ok = false;
                                break; // 此验证点失败
                            }
                        }
                        
