Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
                        if (point_valid) {
                            ESP_LOGI(CO_TAG, "验证点 %d: 验证成功", i + 1);
                        }
                    } else {
                        ESP_LOGE(CO_TAG, "验证点 %d: 数据读取不完整, 预期 %d 字节, 实际 %d 字节", 
                                 i + 1, point->size, bytes_read);
                        verify_ok = false;
                    }
                } else {
                    ESP_LOGE(CO_TAG, "验证点 %d: 接收读取确认失败", i + 1);
                    verify_ok = false;
                }
                
                // 每个验证点之间增加短暂延迟
                vTaskDelay(pdMS_TO_TICKS(10));
            }
            
            if (verify_ok) {
                ESP_LOGI(CO_TAG, "多区段固件验证成功");
            } else {
                ESP_LOGE(CO_TAG, "多区段固件验证失败");
                return "固件验证失败";
            }
        } else {
            // 回退到简单验证
            ESP_LOGW(CO_TAG, "没有验证点，执行简单验证");
            // ... 原有的简单验证代码 ...
        }
        
        if (verify_ok) {
            ESP_LOGI(CO_TAG, "准备重置并运行STM32应用程序");
            
            // 发送执行命令
            uint8_t go_cmd[2] = {0x21, 0xDE};
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)go_cmd, 2);
            
            // 等待ACK
            uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500));
            
            // 发送执行地址（通常是0x08000000）
            uint32_t go_addr = 0x08000000;
            uint8_t addr_bytes[4];
            addr_bytes[0] = (go_addr >> 24) & 0xFF;
            addr_bytes[1] = (go_addr >> 16) & 0xFF;
            addr_bytes[2] = (go_addr >> 8) & 0xFF;
            addr_bytes[3] = go_addr & 0xFF;
            
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)addr_bytes, 4);
            uint8_t go_checksum = stm32_checksum(addr_bytes, 4);
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&go_checksum, 1);
            
            // 最后的ACK可能收不到，因为STM32已经开始执行应用了
            uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(100));
        }
    }

    // 释放资源
    uart_driver_delete(global_cb->ota.isp_uart_port);
    return NULL; // 成功
}


/*  RFC 6455: The WebSocket Protocol

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-------+-+-------------+-------------------------------+
    |F|R|R|R| opcode|M| Payload len |    Extended payload length    |
    |I|S|S|S|  (4)  |A|     (7)     |             (16/64)           |
    |N|V|V|V|       |S|             |   (if payload len==126/127)   |
    | |1|2|3|       |K|             |                               |
    +-+-+-+-+-------+-+-------------+ - - - - - - - - - - - - - - - +
    |     Extended payload length continued, if payload len == 127  |
    + - - - - - - - - - - - - - - - +-------------------------------+
    |                               |Masking-key, if MASK set to 1  |
    +-------------------------------+-------------------------------+
    | Masking-key (continued)       |          Payload Data         |
    +-------------------------------- - - - - - - - - - - - - - - - +
    :                     Payload Data continued ...                :
    + - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - +
    |                     Payload Data continued ...                |
    +---------------------------------------------------------------+
*/

#define WS_FIN 0x80
#define WS_RSV1 0x40
#define WS_RSV2 0x20
#define WS_RSV3 0x10
#define WS_OPCODE_CONTINUTAION 0x00
#define WS_OPCODE_TEXT 0x01
#define WS_OPCODE_BINARY 0x02
#define WS_OPCODE_CLOSE 0x08
#define WS_OPCODE_PING 0x09
#define WS_OPCODE_PONG 0x0A

#define WS_MASK 0x80

static inline int co_websocket_get_res_payload_offset(int payload_len)
{
    //  promise: payload_len <= 65535
    return 2 + (payload_len >= 126 ? 2 : 0);
}

static co_err_t co_websocket_process_header(co_cb_t *cb, co_socket_cb_t *scb)
{
    uint8_t opcode, fin, mask;
    uint64_t payload_len;
    uint8_t *data;

    data = (uint8_t *)scb->buf;

    if (scb->status == CO_SOCKET_WEBSOCKET_HEADER)
    {
        if (scb->remaining_len < 2)
        {
            return CO_OK;
        }

        // check RSV
        if (data[0] & 0b1110000)
        {
            return CO_FAIL; // no extension defining RSV
        }

        // first byte
        fin = (data[0] & WS_FIN) == WS_FIN;
        opcode = data[0] & 0b1111;
        // second byte
        mask = (data[1] & WS_MASK) == WS_MASK;
        payload_len = data[1] & 0x7F;

        switch (opcode)
        {
        case WS_OPCODE_CONTINUTAION:
            // nothing to do
            break;
        case WS_OPCODE_TEXT:
        case WS_OPCODE_BINARY:
            scb->wcb.OPCODE = opcode;
            break;
        case WS_OPCODE_PING:
        case WS_OPCODE_PONG:
            scb->wcb.OPCODE = opcode;
            break;
        case WS_OPCODE_CLOSE:
            scb->wcb.OPCODE = opcode;
            break;
        default:
            return CO_FAIL;
            break;
        }

        scb->wcb.FIN = fin;
        scb->wcb.MASK = mask;
        scb->wcb.payload_len = payload_len;

        // extended payload length should be read
        if (payload_len == 126 || payload_len == 127)
        {
            scb->status = CO_SOCKET_WEBSOCKET_EXTEND_LENGTH;
        }
        else if (mask == 1)
        {
            scb->status = CO_SOCKET_WEBSOCKET_MASK;
        }

        scb->read_len = 2; // first 2 byte header
    }

    if (scb->status == CO_SOCKET_WEBSOCKET_EXTEND_LENGTH)
    {
        if (scb->wcb.payload_len == 126)
        {
            if (scb->remaining_len < scb->read_len + 2)
            { // 2 byte extended length
                return CO_OK;
            }

            payload_len = data[2] << 8 | data[3]; // 0 + scb->read_len == 2

            scb->read_len += 2;
        }
        else if (scb->wcb.payload_len == 127)
        { // 8 byte extended length
            if (scb->remaining_len < scb->read_len + 8)
            {
                return CO_OK;
            }

            payload_len = ((uint64_t)(data[9]) << 0);
            payload_len |= ((uint64_t)(data[8]) << 8);
            payload_len |= ((uint64_t)(data[7]) << 16);
            payload_len |= ((uint64_t)(data[6]) << 24);
            payload_len |= ((uint64_t)(data[5]) << 32);
            payload_len |= ((uint64_t)(data[4]) << 40);
            payload_len |= ((uint64_t)(data[3]) << 48);
            payload_len |= ((uint64_t)(data[2]) << 56);

            // most significant bit MUST be 0
            if (((payload_len >> 63) & 0b1) == 0x1)
            {
                ESP_LOGE(CO_TAG, "wrong payload length");
                return CO_FAIL;
            }

            scb->read_len += 8;
        }
        else
        {
            payload_len = scb->wcb.payload_len;
        }

        scb->wcb.payload_len = payload_len;

        scb->status = scb->wcb.MASK == 1 ? CO_SOCKET_WEBSOCKET_MASK : CO_SOCKET_WEBSOCKET_PAYLOAD;
    }

    if (scb->status == CO_SOCKET_WEBSOCKET_MASK)
    {
        if (scb->remaining_len < scb->read_len + 4)
        { // 4 byte mask
            return CO_OK;
        }

        memcpy(&scb->wcb.mask.data[0], &data[scb->read_len], 4);
        scb->read_len += 4;
        scb->status = CO_SOCKET_WEBSOCKET_PAYLOAD;
    }
    else
    {
        scb->status = CO_SOCKET_WEBSOCKET_PAYLOAD;
    }

    return CO_OK;
}

