Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
// We promise that the length of the payload should not exceed 65535
static co_err_t co_websocket_send_frame(void *frame_buffer, size_t payload_len, int frame_type)
{
    int sz;
    uint16_t payload_length;
    uint8_t *p;

    payload_length = payload_len;
    sz = co_websocket_get_res_payload_offset(payload_len) + payload_len;

    p = frame_buffer;
    // 2 bytes
    *p++ = WS_FIN | frame_type; // frame_type
    *p++ = (payload_length >= 126 ? 126 : payload_length);

    // extended length
    if (payload_length >= 126)
    {
        payload_length = htons(payload_length);
        memcpy(p, &payload_length, 2);
        p += 2;
    }

    // no mask

    send(global_cb->websocket->fd, frame_buffer, sz, 0);

    return CO_OK;
}

// Create a new frame buffer, construct text and send frame.
static co_err_t co_websocket_send_msg_with_code(int code, const char *msg)
{
    char *buffer;
    int len, ret;
    int offset;

    len = strlen(msg);
    offset = co_websocket_get_res_payload_offset(len);
    buffer = malloc(offset + len + 25);
    if (buffer == NULL)
    {
        ret = CO_ERROR_NO_MEM;
        goto cleanup;
    }

    if (code == CO_RES_SUCCESS)
    {
        ret = snprintf(buffer + offset, len + 24, "code=%d&data=\"%s\"", code, msg);
    }
    else
    {
        ret = snprintf(buffer + offset, len + 24, "code=%d&data=\"msg=%s\"", code, msg);
    }

    if (ret < 0)
    {
        ESP_LOGE(CO_TAG, "invalid arg");
        ret = CO_ERROR_INVALID_ARG;
        goto cleanup;
    }

    ret = co_websocket_send_frame(buffer, ret, WS_OPCODE_TEXT);

cleanup:
    free(buffer);
    return ret;
}

#if (CO_TEST_MODE == 1)
// use for test
static co_err_t co_websocket_send_echo(void *data, size_t len, int frame_type)
{
    char *buffer;
    int ret;
    int offset;

    offset = co_websocket_get_res_payload_offset(len);
    buffer = malloc(offset + len);
    if (buffer == NULL)
    {
        ret = CO_ERROR_NO_MEM;
        goto cleanup;
    }
    memcpy(buffer + offset, data, len);

    ret = co_websocket_send_frame(buffer, len, frame_type);

cleanup:
    free(buffer);
    return ret;
}
#endif // (CO_TEST_MODE == 1)

static const char *co_ota_error_to_msg(esp_err_t err)
{
    switch (err)
    {
    case ESP_OK:
        return NULL;
    case ESP_ERR_NO_MEM:
        return "No Mem";
    case ESP_ERR_INVALID_ARG:
        return "Invalid handle";
    case ESP_ERR_OTA_VALIDATE_FAILED:
        return "Invalid firmware";
    case ESP_ERR_INVALID_SIZE:
        return "Firmware size too large";
    case ESP_ERR_OTA_SELECT_INFO_INVALID:
        return "Invalid partition info";
    case ESP_ERR_NOT_FOUND:
        return "OTA partition not found";
    case ESP_ERR_FLASH_OP_TIMEOUT:
    case ESP_ERR_FLASH_OP_FAIL:
        return "Flash write failed";
    case ESP_ERR_INVALID_STATE:
        return "Flash encryption is enabled";
    default:
        return "OTA Failed";
    }
}

/**
 * @brief OTA init
 *
 * @param size Total firmware size
 * @return const char* Error message, returns NULL indicating that no error occurred
 */
static const char *co_ota_init(int32_t size)
{
    const esp_partition_t *boot_ptn, *running_ptn, *update_ptn;
    esp_err_t ret;

    boot_ptn = esp_ota_get_boot_partition();
    running_ptn = esp_ota_get_running_partition();
    if (boot_ptn != running_ptn)
    {
        //// TODO:  boot image become corrupted
    }

    update_ptn = esp_ota_get_next_update_partition(NULL);
    if (update_ptn == NULL)
    {
        global_cb->ota.status = CO_OTA_FATAL_ERROR;
        global_cb->ota.error_code = CO_ERROR_INVALID_OTA_PTN;
        return "Invalid OTA data partition";
    }

    // Start erase flash
    //// TODO: full chip erase
    ret = esp_ota_begin(update_ptn, size, &global_cb->ota.update_handle);

    global_cb->ota.update_ptn = update_ptn;

    return co_ota_error_to_msg(ret);
}

// write ota data
static const char *co_ota_write(void *data, size_t len)
{
    esp_err_t ret = esp_ota_write(global_cb->ota.update_handle, data, len);
    return co_ota_error_to_msg(ret);
}

static const char *co_ota_end()
{
    esp_err_t ret = esp_ota_end(global_cb->ota.update_handle);

    if (ret != ESP_OK)
    {
        return co_ota_error_to_msg(ret);
    }

    ret = esp_ota_set_boot_partition(global_cb->ota.update_ptn);
    return co_ota_error_to_msg(ret);
}

/**
 * @brief Process OTA start request
 *
 * @param data Pointer to a string indicating the size of the firmware
 */
// static void co_ota_start(void *data) { // TODO: return value -> status
//     const char *res_msg = "deviceType=" CO_DEVICE_TYPE_NAME "&state=ready&offset=0";
//     const char *err_msg;
//     int size;

//     // may be we should ignore status...
//     // if (global_cb->ota.status != CO_OTA_INIT && global_cb->ota.status != CO_OTA_STOP) {
//     //     co_websocket_send_msg_with_code(CO_RES_INVALID_STATUS, "OTA has not started");
//     //     return;
//     // }

//     size = atoi(data);
//     if (size < 1) {
//         co_websocket_send_msg_with_code(CO_RES_INVALID_SIZE, "Invalid size");
//         return;
//     }

//     err_msg = co_ota_init(size);
//     if (err_msg != NULL) {
//         co_websocket_send_msg_with_code(CO_RES_SYSTEM_ERROR, err_msg);
//         return;
//     }

//     global_cb->ota.status = CO_OTA_LOAD;
//     global_cb->ota.total_size = size;

//     size = min(global_cb->ota.total_size / 10, 1024 * 10); // 10KB default
//     if (size == 0) {
//         size = 1; // Firmware too small...
//     }

//     global_cb->ota.chunk_size = size;
//     global_cb->ota.offset = 0;
//     global_cb->ota.last_index_offset = 0;

//     co_websocket_send_msg_with_code(CO_RES_SUCCESS, res_msg);
// }

static void co_ota_start(void *data)
{
    char op_field[10 + 1] = {0};
    char data_field[10 + 1] = {0};
    char target_field[10 + 1] = {0};
    char options_field[50 + 1] = {0};
    const char *res_msg;
    const char *err_msg = NULL;
    int size;

    // 解析参数
    if (co_parse_request_text((const char *)data, op_field, data_field, target_field, options_field) != CO_OK)
    {
        co_websocket_send_msg_with_code(CO_RES_INVALID_ARG, "解析参数失败");
        return;
    }

    // 提取固件大小
    size = atoi(data_field);
    if (size < 1)
    {
        co_websocket_send_msg_with_code(CO_RES_INVALID_SIZE, "无效的固件大小");
        return;
    }

