Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
static esp_err_t co_websocket_process(co_cb_t *cb, co_socket_cb_t *scb)
{
    if (cb->websocket != scb)
    {
        return ESP_FAIL;
    }
    int fd, ret, offset;

    fd = scb->fd;
    offset = scb->remaining_len;

    ret = recv(fd, scb->buf + offset, CONFIG_CO_SOCKET_BUFFER_SIZE - offset, 0);
    if (ret <= 0)
    {
        return ESP_FAIL;
    }
    scb->remaining_len += ret;

    do
    {
        // After we process a partial or complete payload,
        // we always receive a new payload or header starting from the head of the buf.
        if (scb->status != CO_SOCKET_WEBSOCKET_PAYLOAD)
        {
            ret = co_websocket_process_header(cb, scb);
            if (ret != CO_OK)
            {
                return CO_FAIL;
            }
        }

        // Perhaps we have already read the header section, and if there are extra bytes left over,
        // we continue reading the payload section.
        if (scb->status == CO_SOCKET_WEBSOCKET_PAYLOAD)
        {
            ret = co_websocket_process_payload(cb, scb);
            if (ret == CO_FAIL)
            {
                return CO_FAIL;
            }
        }
    } while (ret == CO_ERROR_IO_PENDING);

    return ESP_OK;
}

/**
 * @brief parse HTTP header lines of format:
 *        \r\nfield_name: value1, value2, ... \r\n
 *
 * @param header_start
 * @param header_end
 * @param field_name
 * @param value Optional value
 * @return const char* The specific value starts, or the beginning of value in field.
 */
static const char *co_http_header_find_field_value(const char *header_start, const char *header_end, const char *field_name, const char *value)
{
    const char *field_start, *field_end, *next_crlf, *value_start;
    int field_name_len;

    field_name_len = (int)strlen(field_name);

    field_start = header_start;
    do
    {
        field_start = strcasestr(field_start + 1, field_name);
        field_end = field_start + field_name_len - 1;

        if (field_start != NULL && field_start - header_start >= 2 && field_start[-2] == '\r' && field_start[-1] == '\n')
        { // is start with "\r\n" ?
            if (header_end - field_end >= 1 && field_end[1] == ':')
            { // is end with ':' ?
                break;
            }
        }
    } while (field_start != NULL);

    if (field_start == NULL)
    {
        return NULL;
    }

    // find the field terminator
    next_crlf = strcasestr(field_start, "\r\n");
    if (next_crlf == NULL)
    {
        return NULL; // Malformed HTTP header!
    }

    // If not looking for a value, then return a pointer to the start of values string
    if (value == NULL)
    {
        return field_end + 2; // 2 for ':'  ' '(blank)
    }

    value_start = strcasestr(field_start, value);
    if (value_start == NULL)
    {
        return NULL;
    }

    if (value_start > next_crlf)
    {
        return NULL; // encounter with unanticipated CRLF
    }

    // The value we found should be properly delineated from the other tokens
    if (isalnum((unsigned char)value_start[-1]) || isalnum((unsigned char)value_start[strlen(value)]))
    {
        // "field_name: value1, value2,"
        // Consecutive tokens will be considered as errors.
        return NULL;
    }

    return value_start;
}

static void co_http_error_400_response(co_cb_t *cb, co_socket_cb_t *scb)
{
    const char *error = "HTTP/1.1 400 Bad Request\r\n\r\n";
    send(scb->fd, error, strlen(error), 0);
}

#define WS_GUID "258EAFA5-E914-47DA-95CA-C5AB0DC85B11"

int co_sha1(const unsigned char *src, size_t src_len, unsigned char *dst)
{
    return mbedtls_sha1_ret(src, src_len, dst);
}

int co_base64_encode(unsigned char *dst, size_t dst_len, size_t *written_len, unsigned char *src, size_t src_len)
{
    return mbedtls_base64_encode(dst, dst_len, written_len, src, src_len);
}

static esp_err_t co_websocket_create_accept_key(char *dst, size_t dst_len, const char *client_key)
{
    uint8_t sha1buf[20], key_src[60];

    memcpy(key_src, client_key, 24);
    memcpy(key_src + 24, WS_GUID, 36);

    if (co_sha1(key_src, sizeof(key_src), sha1buf) != 0)
    {
        return ESP_FAIL;
    }

    size_t base64_encode_len;
    if (co_base64_encode((unsigned char *)dst, dst_len, &base64_encode_len, sha1buf, sizeof(sha1buf)) != 0)
    {
        return ESP_FAIL;
    }

    // add terminator
    dst[base64_encode_len] = '\0';

    return ESP_OK;
}

static esp_err_t co_websocket_handshake_send_key(int fd, const char *client_key)
{
    char res_header[256], accept_key[29];
    int res_header_length;

    if (co_websocket_create_accept_key(accept_key, sizeof(accept_key), client_key) != ESP_OK)
    {
        ESP_LOGE(CO_TAG, LOG_FMT("fail to create accept key"));
        return ESP_FAIL;
    }

    snprintf(res_header, sizeof(res_header),
             "HTTP/1.1 101 Switching Protocols\r\n"
             "Server: corsacOTA server\r\n"
             "Upgrade: websocket\r\n"
             "Connection: Upgrade\r\n"
             "Sec-WebSocket-Accept: %s\r\n"
             "\r\n",
             accept_key);

    res_header_length = strlen(res_header);
    send(fd, res_header, res_header_length, 0);

    return ESP_OK;
}

static esp_err_t co_websocket_handshake_process(co_cb_t *cb, co_socket_cb_t *scb)
{
    if (scb->remaining_len == 0)
    {
        memset(scb->buf, 0, CONFIG_CO_SOCKET_BUFFER_SIZE);
    }

    int offset = scb->remaining_len;
    int fd = scb->fd;

    int ret = recv(fd, scb->buf + offset, CONFIG_CO_SOCKET_BUFFER_SIZE - offset, 0);
    if (ret <= 0)
    {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    scb->remaining_len += ret;

    // Already received the entire http header?
    if (scb->remaining_len < 4 || memcmp(scb->buf + scb->remaining_len - 4, "\r\n\r\n", 4) != 0)
    {
        return ESP_OK; // Not yet received
    }

    const char *header_start = scb->buf, *header_end = scb->buf + scb->remaining_len - 1;
    const char *ws_key_start, *ws_key_end;

    if (co_http_header_find_field_value(header_start, header_end, "Upgrade", "websocket") == NULL ||
        co_http_header_find_field_value(header_start, header_end, "Connection", "Upgrade") == NULL ||
        (ws_key_start = co_http_header_find_field_value(header_start, header_end, "Sec-WebSocket-Key", NULL)) == NULL)
    {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    /* example:
     Sec-WebSocket-Key: c2REMVVpRXJRQWJ0Q1dKeQ==\r\n
                       |
                    ws_key_start
    */

    // skip the extra blank
    for (; *ws_key_start == ' '; ws_key_start++)
    {
        ;
    }

    // find the end of ws key
    for (ws_key_end = ws_key_start; *ws_key_end != '\r' && *ws_key_end != ' '; ws_key_end++)
    {
        ;
    }

    /* example:
     Sec-WebSocket-Key: c2REMVVpRXJRQWJ0Q1dKeQ==\r\n
                        |                       ||
                    ws_key_start            ws_key_end
    */
    if (ws_key_end - ws_key_start != 24)
    {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

