Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
    if (co_websocket_handshake_send_key(scb->fd, ws_key_start) != ESP_OK)
    {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    ESP_LOGD(CO_TAG, "websocket handshake success");

    cb->websocket = scb;
    scb->status = CO_SOCKET_WEBSOCKET_HEADER;
    scb->remaining_len = 0;

    memset(scb->buf, 0, CONFIG_CO_SOCKET_BUFFER_SIZE);

    return ESP_OK;
}

static esp_err_t co_socket_data_process(co_cb_t *cb, co_socket_cb_t *scb)
{
    if (cb == NULL || scb == NULL)
    {
        return ESP_ERR_INVALID_ARG;
    }

    switch (scb->status)
    {
    case CO_SOCKET_ACCEPT:
        ESP_LOGW(CO_TAG, LOG_FMT("This state should not occur"));
        return ESP_FAIL; //// TODO: remove this?
    case CO_SOCKET_HANDSHAKE:
        return co_websocket_handshake_process(cb, scb);
    case CO_SOCKET_WEBSOCKET_HEADER:
    case CO_SOCKET_WEBSOCKET_EXTEND_LENGTH:
    case CO_SOCKET_WEBSOCKET_MASK:
    case CO_SOCKET_WEBSOCKET_PAYLOAD:
        return co_websocket_process(cb, scb);
    default:
        ESP_LOGW(CO_TAG, LOG_FMT("This state should not occur"));
        return ESP_OK;
    }
}

static esp_err_t co_socket_list_alloc(co_cb_t *cb)
{
    if (cb == NULL)
    {
        return ESP_ERR_INVALID_ARG;
    }

    int i;
    cb->socket_list = calloc(cb->max_listen_num, sizeof(co_socket_cb_t *)); // pointer list
    if (cb->socket_list == NULL)
    {
        return ESP_ERR_NO_MEM;
    }

    for (i = 0; i < cb->max_listen_num; i++)
    {
        if ((cb->socket_list[i] = calloc(1, sizeof(struct co_socket_cb))) == NULL)
        {
            goto fail;
        }
    }
    return ESP_OK;

fail:
    for (i = 0; i < cb->max_listen_num; i++)
    {
        if (cb->socket_list[i] != NULL)
        {
            free(cb->socket_list[i]);
        }
    }
    free(cb->socket_list);
    cb->socket_list = NULL;
    return ESP_ERR_NO_MEM;
}

/**
 * @brief add a new fd to socket list
 *
 * @param cb corsacOTA control block
 * @param fd socket file descriptor
 * @return err_t
 */
static err_t co_socket_list_insert(co_cb_t *cb, int fd)
{
    int i;
    for (i = 0; i < cb->max_listen_num; i++)
    {
        if (cb->socket_list[i]->fd == -1)
        {
            cb->socket_list[i]->fd = fd;
            return ESP_OK;
        }
    }

    return ESP_FAIL;
}

/**
 * @brief Iterate to get each socket control blck in socket list
 *
 * @param cb corsacOTA control block
 * @param begin The fd obtained in the previous iteration. Should be `NULL` for the initial iteration.
 * @param ignore_closing If true, all fd's that are closing will be ignored.
 * @return int The current socket control block obtained by the iterator, or `NULL` for not found.
 */
static co_socket_cb_t *co_socket_list_iterate(co_cb_t *cb, co_socket_cb_t *begin, bool ignore_closing)
{
    int start_index = 0;
    int i;

    if (begin != NULL)
    {
        for (i = 0; i < cb->max_listen_num; i++)
        {
            if (cb->socket_list[i] == begin)
            {
                start_index = i + 1;
                break;
            }
        }
    }

    for (i = start_index; i < cb->max_listen_num; i++)
    {
        if (cb->socket_list[i]->fd != -1)
        {
            if (ignore_closing && cb->socket_list[i]->status == CO_SOCKET_CLOSING)
            {
                continue;
            }
            return cb->socket_list[i];
        }
    }

    return NULL;
}

/**
 * @brief Invalidate all sockets in the list in the accept stage
 *
 * @param cb corsacOTA cotrol block pointer
 */
static void co_socket_list_init(co_cb_t *cb)
{
    int i;
    for (i = 0; i < cb->max_listen_num; i++)
    {
        cb->socket_list[i]->fd = -1;
        cb->socket_list[i]->status = CO_SOCKET_ACCEPT;
    }
}

static co_cb_t *co_control_block_create(co_config_t *config)
{
    co_cb_t *cb = calloc(1, sizeof(co_cb_t));
    if (cb == NULL)
    {
        return NULL;
    }

    cb->recv_data = malloc(CONFIG_CO_WS_TEXT_BUFFER_SIZE + 1);
    if (cb->recv_data == NULL)
    {
        free(cb);
        return NULL;
    }

    // setting
    cb->max_listen_num = config->max_listen_num;
    cb->wait_timeout_sec = config->wait_timeout_sec;
    cb->wait_timeout_usec = config->wait_timeout_usec;

    cb->listen_fd = -1;
    cb->websocket_fd = -1;

    cb->recv_data_offset = 0;

    if (co_socket_list_alloc(cb) != ESP_OK)
    {
        free(cb);
        return NULL;
    }
    return cb;
}

static void co_free_all(co_cb_t *cb)
{
    if (cb == NULL)
    {
        return;
    }

    int i;
    if (cb->socket_list != NULL)
    {
        for (i = 0; i < cb->max_listen_num; i++)
        {
            if (cb->socket_list[i] != NULL)
            {
                if (cb->socket_list[i]->fd != -1)
                {
                    close(cb->socket_list[i]->fd);
                }
                free(cb->socket_list[i]->buf);
            }
            free(cb->socket_list[i]);
        }
        free(cb->socket_list);
    }

    if (cb->listen_fd != -1)
    {
        close(cb->listen_fd);
    }

    free(cb->recv_data);

    free(cb);
    global_cb = NULL;
}

/**
 * @brief free the specified socket control block
 *
 * @param scb Socket control block included in cb
 */
static void co_socket_buf_free(co_socket_cb_t *scb)
{
    free(scb->buf);
    scb->buf = NULL;
    scb->remaining_len = 0;
    scb->read_len = 0;
}

static int co_socket_init(co_cb_t *cb, co_config_t *config)
{
#if (defined CONFIG_LWIP_IPV6) && (CONFIG_LWIP_IPV6 == 1)
    int fd = socket(PF_INET6, SOCK_STREAM, 0);
#else
    int fd = socket(PF_INET, SOCK_STREAM, 0);
#endif // (defined CONFIG_LWIP_IPV6) && (CONFIG_LWIP_IPV6 == 1)
    if (fd < 0)
    {
        ESP_LOGE(CO_TAG, LOG_FMT("error in socket (%d)"), errno);
        return ESP_FAIL;
    }

#if (defined CONFIG_LWIP_IPV6) && (CONFIG_LWIP_IPV6 == 1)
    struct in6_addr inaddr_any = IN6ADDR_ANY_INIT;
    struct sockaddr_in6 serv_addr = {
        .sin6_family = PF_INET6,
        .sin6_addr = inaddr_any,
        .sin6_port = htons(config->listen_port),
    };
#else
    struct sockaddr_in serv_addr = {
        .sin_family = PF_INET,
        .sin_addr = {
            .s_addr = htonl(INADDR_ANY)},
        .sin_port = htons(config->listen_port),
    };
#endif // (defined CONFIG_LWIP_IPV6) && (CONFIG_LWIP_IPV6 == 1)
    int ret = bind(fd, (struct sockaddr *)&serv_addr, sizeof(serv_addr));
    if (ret < 0)
    {
        ESP_LOGE(CO_TAG, LOG_FMT("error in bind (%d)"), errno);
        close(fd);
        return ESP_FAIL;
    }

