Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
    ret = listen(fd, config->max_listen_num);
    if (ret < 0)
    {
        ESP_LOGE(CO_TAG, LOG_FMT("error in listen (%d)"), errno);
        close(fd);
        return ESP_FAIL;
    }

    cb->listen_fd = fd;
    return ESP_OK;
}

/**
 * @brief Accept a new connection, set the timeout, insert it into socket list,
 *        allocate the memory needed for the connection
 * @param cb corsacOTA control block
 * @return esp_err_t
 * - ESP_OK accept successfully
 */
static esp_err_t co_socket_accept(co_cb_t *cb)
{
    struct sockaddr_in addr_from;
    socklen_t addr_from_len = sizeof(addr_from);
    int new_fd = accept(cb->listen_fd, (struct sockaddr *)&addr_from, &addr_from_len);
    if (new_fd < 0)
    {
        ESP_LOGW(CO_TAG, LOG_FMT("error in accept (%d)"), errno);
        return ESP_FAIL;
    }

    struct timeval tv;
    // set recv timrout
    tv.tv_sec = cb->wait_timeout_usec;
    tv.tv_usec = cb->wait_timeout_usec;
    setsockopt(new_fd, SOL_SOCKET, SO_RCVTIMEO, (const char *)&tv, sizeof(tv));

    // set send timeout
    tv.tv_sec = cb->wait_timeout_usec;
    tv.tv_usec = cb->wait_timeout_usec;
    setsockopt(new_fd, SOL_SOCKET, SO_SNDTIMEO, (const char *)&tv, sizeof(tv));

    // try to add to the socket list
    if (co_socket_list_insert(cb, new_fd) != ESP_OK)
    {
        ESP_LOGW(CO_TAG, LOG_FMT("Unable to add to socket list"));
        close(new_fd);
        return ESP_FAIL;
    }

    // create new buffer
    int i;
    co_socket_cb_t *scb = NULL;
    for (i = 0; i < cb->max_listen_num; i++)
    { // find the corresponding SCB
        if (cb->socket_list[i]->fd == new_fd)
        {
            scb = cb->socket_list[i];
            break;
        }
    }
    assert(scb != NULL);
    scb->buf = malloc(CONFIG_CO_SOCKET_BUFFER_SIZE + 1);
    scb->remaining_len = 0;
    if (scb->buf == NULL)
    {
        close(new_fd);
        return ESP_ERR_NO_MEM;
    }

    scb->status = CO_SOCKET_HANDSHAKE;

    return ESP_OK;
}

static void co_socket_set_non_block(int fd)
{
    int flag;
    if ((flag = fcntl(fd, F_GETFL, 0)) < 0)
    {
        return;
    }

    flag |= O_NONBLOCK;
    fcntl(fd, F_SETFL, flag);
}

/**
 * @brief Close the socket and set its state
 *
 * @param cb corsacOTA control block
 * @param scb corsacOTA socket control block
 */
static void co_socket_close(co_cb_t *cb, co_socket_cb_t *scb)
{
    cb->closing_num++;
    scb->status = CO_SOCKET_CLOSING;

    if (cb->websocket == scb)
    {
        cb->websocket = NULL;
    }

    co_socket_set_non_block(scb->fd);
    shutdown(scb->fd, SHUT_WR); // wait client to close socket
}

static void co_socket_close_cleanup(co_cb_t *cb)
{
    int ret;
    co_socket_cb_t *iter;

    iter = NULL;

    while ((iter = co_socket_list_iterate(cb, iter, false)) != NULL)
    {
        if (iter->status != CO_SOCKET_CLOSING)
        {
            continue;
        }

        ret = recv(iter->fd, iter->buf, CONFIG_CO_SOCKET_BUFFER_SIZE, 0);
        if (ret == 0 || errno == ENOTCONN)
        { // client gracefully closed connection
            close(iter->fd);
            co_socket_buf_free(iter);

            iter->status = CO_SOCKET_ACCEPT;
            iter->fd = -1;

            cb->closing_num--;
        }
    }
}

/**
 * @brief Set and find the largest fd in socket list only
 *
 */
static int co_select_update_maxfd(co_cb_t *cb, fd_set *fdset)
{
    int i;
    int maxfd = -1;
    for (i = 0; i < cb->max_listen_num; i++)
    {
        if (cb->socket_list[i] != NULL && cb->socket_list[i]->fd != -1)
        {
            FD_SET(cb->socket_list[i]->fd, fdset);
            maxfd = MAX(maxfd, cb->socket_list[i]->fd);
        }
    }
    return maxfd;
}

static int co_select_fd_is_valid(int fd)
{
    return fcntl(fd, F_GETFD, 0) != -1 || errno != EBADF;
}

static void co_select_clean_invalid(co_cb_t *cb)
{
    int i;
    for (i = 0; i < cb->max_listen_num; i++)
    {
        if (cb->socket_list[i] != NULL && cb->socket_list[i]->fd != -1 &&
            !co_select_fd_is_valid(cb->socket_list[i]->fd))
        {
            co_socket_buf_free(cb->socket_list[i]);
        }
    }
}

/**
 * @brief The select function will be processed here.
 *
 * @param cb corsacOTA control block
 * @return esp_err_t
 * - ESP_OK success
 * - others: need to close server.
 */
static esp_err_t co_select_process(co_cb_t *cb)
{
    fd_set read_set;
    FD_ZERO(&read_set);
    FD_SET(cb->listen_fd, &read_set);

    int maxfd = co_select_update_maxfd(cb, &read_set);
    maxfd = MAX(maxfd, cb->listen_fd);

    struct timeval tv;
    // Set recv timeout of this fd as per config
    tv.tv_sec = cb->wait_timeout_sec;
    tv.tv_usec = cb->wait_timeout_usec;

    int ret = select(maxfd + 1, &read_set, NULL, NULL, &tv);
    if (ret < 0)
    {
        ESP_LOGE(CO_TAG, LOG_FMT("error in select (%d)"), errno);
        co_select_clean_invalid(cb);
        return ESP_OK;
    }
    else if (ret == 0)
    {
        return ESP_ERR_TIMEOUT;
    }

    // 1. Find out if there is any data available on the socket list
    co_socket_cb_t *iter = NULL;
    while ((iter = co_socket_list_iterate(cb, iter, true)) != NULL)
    {
        if (FD_ISSET(iter->fd, &read_set))
        {
            if (co_socket_data_process(cb, iter) != ESP_OK)
            {
                co_socket_close(cb, iter);
            }
        }
    }

    // 2. There are new connections waiting to be accepted
    if (FD_ISSET(cb->listen_fd, &read_set))
    {
        if (co_socket_accept(cb) != ESP_OK)
        {
            ESP_LOGW(CO_TAG, LOG_FMT("can not accept a new connnection"));
        }
    }

    // 3. clean up
    if (cb->closing_num > 0)
    {
        co_socket_close_cleanup(cb);
    }

    // TODO: control port?

    return ESP_OK;
}

static void co_main_thread(void *pvParameter)
{
    // co_config_t *server_config = (co_config_t *)pvParameter;
    ESP_LOGI(CO_TAG, "start corsacOTA thread..."); // TODO: debug

    do
    {
        ;
    } while (co_select_process(global_cb) == ESP_OK);

    co_free_all(global_cb);
    vTaskDelete(NULL);
}

static inline int co_thread_create(co_config_t *config)
{
    int ret = xTaskCreate(co_main_thread, config->thread_name, config->stack_size, config,
                          config->thread_prio, NULL);
    if (ret == pdPASS)
    {
        return ESP_OK;
    }
    ESP_LOGE(CO_TAG, "can not create corsacOTA thread:%d", ret);
    return ESP_FAIL;
}

int corsacOTA_init(co_handle_t *handle, co_config_t *config)
{
    if (handle == NULL || config == NULL)
    {
        return ESP_ERR_INVALID_ARG;
    }

    if (global_cb != NULL)
    {
        ESP_LOGE(CO_TAG, "already init");
        return ESP_FAIL;
    }

    co_cb_t *cb = co_control_block_create(config);
    if (cb == NULL)
    {
        return ESP_ERR_NO_MEM;
    }

    int ret = co_socket_init(cb, config);
    if (ret != ESP_OK)
    {
        co_free_all(cb);
        return ESP_FAIL;
    }

    co_socket_list_init(cb);
    global_cb = cb;
    // start new corsacOTA thread
    if (co_thread_create(config) != ESP_OK)
    {
        co_free_all(cb);
        return ESP_FAIL;
    }

    *handle = (co_handle_t *)cb;
    return ESP_OK;
}
